{
  "backend/main.mo": "Main backend actor implementing e-commerce functionality with access control, including product management (admin-only), cart operations (user-only), order processing, and user profile management using blob storage and authorization mixins.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features (home page with categories, product listing with filtering, add-to-cart functionality, cart page with quantity controls, and checkout page) with high confidence and associated test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React application structure with TanStack Router, pages for home/products/cart/checkout/admin, reusable components, React Query hooks for backend integration, and green-themed styling.",
  "frontend/index.css": "Tailwind CSS base styles with custom OKLCH color system defining light and dark mode color tokens, using white background and green primary colors for the HD Providers brand.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and title 'HD Providers', loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, products, cart, checkout, order confirmation, and admin pages, wrapped in a layout with navigation, footer with caffeine.ai attribution, and toast notifications.",
  "frontend/src/components/AccessDeniedScreen.tsx": "Access denied screen component displaying a shield alert icon and message for unauthorized users attempting to access admin areas, with a button to return home.",
  "frontend/src/components/CartItem.tsx": "Cart item component displaying product details with quantity adjustment controls (plus/minus buttons), remove button, and subtotal calculation using React Query mutations for cart updates.",
  "frontend/src/components/CategoryCard.tsx": "Reusable category card component with icon, image, colored background, and hover effects that triggers an onClick callback for navigation.",
  "frontend/src/components/Navigation.tsx": "Navigation bar component with links to Home, Products, Cart (with item count badge), and conditionally-rendered Admin link for admin users.",
  "frontend/src/components/ProductCard.tsx": "Product card component displaying product image, name, category, price, and an 'Add to Cart' button with loading state.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding or editing products with fields for name, price, category, and image upload with progress tracking.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control with admin token from URL params.",
  "frontend/src/hooks/useAuth.ts": "Hook that queries whether the current caller has admin privileges using the backend actor.",
  "frontend/src/hooks/useCart.ts": "Hooks for cart operations including fetching cart summary, adding items, updating quantities, removing items, and checkout with query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle.",
  "frontend/src/hooks/useOrders.ts": "Hooks for fetching individual orders by ID and retrieving all orders for the current user.",
  "frontend/src/hooks/useProducts.ts": "Hooks for product operations including fetching all products, filtering by category, adding new products, and updating existing products.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a green-themed color palette for light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that checks admin authorization, displays a product list in a table, and provides UI to add/edit products via ProductForm component.",
  "frontend/src/pages/CartPage.tsx": "Shopping cart page that displays cart items with CartItem components, shows order summary with total, and provides checkout navigation or empty cart state.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page that displays order summary, allows payment method selection (COD or UPI), and handles order placement with navigation to order confirmation.",
  "frontend/src/pages/HomePage.tsx": "Landing page displaying HD Providers branding with four category cards (Vegetables, Dairy, Groceries, Food) that navigate to filtered product listings.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page that displays order details including ID, payment method, status, items, and total with navigation options to home or continue shopping.",
  "frontend/src/pages/ProductsPage.tsx": "Products listing page with category filter tabs that displays products in a grid, supports adding items to cart, and handles category-based filtering.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom theme extensions including OKLCH color system with CSS variables, container settings, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file documenting HD Providers app requirements including home delivery features (categories, cart, checkout with COD/UPI QR), admin panel, architectural notes about no authentication initially, and tracking of existing and planned features with their requirement IDs."
}